app/views/tasks/_index.html.erb

SELECT "tasks"."id" FROM "tasks"  WHERE (project_document_id= '40' and status= 'Open')
---
  <tbody>
  <%@tasks=Task.where('project_document_id =?',project_document_id)%>

SELECT  "users".* FROM "users"  WHERE "users"."id" = 4 LIMIT 1
---
        <% if current_user.id == @project_manager_user[0]%>
        <td><%= User.find_by_id(task.assigned_id).email %></td>