app/views/tasks/show.html.erb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1 LIMIT 1
---

  <%= User.find_by_id(@task.assignee_id).email%>