app/views/home/index.html.erb

SELECT  "project_documents".* FROM "project_documents"  WHERE "project_documents"."id" = $1 LIMIT 1  [["id", 26]]
SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = $1 LIMIT 1  [["id", 3]]
---
                  <td><%= task.deadline.strftime("%d/%m/%Y") %></td>
                  <td><%= Project.find(ProjectDocument.find(task.project_document_id).project_id).name %></td>

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
---
                  <td><%= task.status %></td>
                  <td><%= User.find(task.assigned_id).email %></td>