app/views/projects/index.html.erb

SELECT "projects".* FROM "projects"  WHERE (id =6)
---
          <tr>
            <% @project=Project.where("id =?", projectteam.project_id) %>