app/views/projects/manage_document.html.erb


              <% if (current_user.id == @project_manager_user[0] && @ARR.document_gid.nil? && Task.where('project_document_id =?', @ARR.id).where("status like ?", "%Open%").blank?) %>
---
SELECT "tasks".* FROM "tasks"  WHERE (project_document_id =47) AND (status like '%Open%')


              <% if (current_user.id == @project_manager_user[0] && @PSA.document_gid.nil? && Task.where('project_document_id =?', @PSA.id).where("status like ?", "%Open%").blank?) %>
---
SELECT "tasks".* FROM "tasks"  WHERE (project_document_id =51) AND (status like '%Open%')


              <% if (current_user.id == @project_manager_user[0] && @HRMP.document_gid.nil? && Task.where('project_document_id =?', @HRMP.id).where("status like ?", "%Open%").blank?) %>
---
SELECT "tasks".* FROM "tasks"  WHERE (project_document_id =49) AND (status like '%Open%')


              <% if (current_user.id == @project_manager_user[0] && @PMP.document_gid.nil? && Task.where('project_document_id =?', @PMP.id).where("status like ?", "%Open%").blank?) %>
---
SELECT "tasks".* FROM "tasks"  WHERE (project_document_id =46) AND (status like '%Open%')


              <% if (current_user.id == @project_manager_user[0] && @RCAL.document_gid.nil? && Task.where('project_document_id =?', @RCAL.id).where("status like ?", "%Open%").blank?) %>
---
SELECT "tasks".* FROM "tasks"  WHERE (project_document_id =52) AND (status like '%Open%')


              <% if (current_user.id == @project_manager_user[0] && @TPA.document_gid.nil? && Task.where('project_document_id =?', @TPA.id).where("status like ?", "%Open%").blank?) %>
---
SELECT "tasks".* FROM "tasks"  WHERE (project_document_id =53) AND (status like '%Open%')