app/helpers/pmbok_doc_outputs_helper.rb

SELECT "pmbok_docs"."id" FROM "pmbok_docs"  WHERE (name ='Activity Resource Requirements')
---
  def get_outputs(doc_name)
    @doc_id=PmbokDoc.where('name =?',doc_name).pluck(:id)