app/controllers/application_controller.rb

  def current_user
    if @@flagTest
      @current_user = User.find(1)
    else
      @current_user ||= User.find(session[:user_id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1