app/controllers/data_file_controller.rb

  def create
    @dataFile = DataFile.create(data_params)

    #Check file
    #check name , size
    # true
    if params[:project_id].to_s != ''

      @projectManager = ProjectsHelper.findProjectManagerById(params[:project_id])

      #Rails.logger.debug('Project manager token' + "#{@projectManager.access_token}")
      #Rails.logger.debug('Project manager id' + "#{@projectManager.id}")

      getFileType(@dataFile.document_content_type)
      #Rails.logger.debug("#{ProjectDocument.find(params[:document_id]).getFileNameWithNewVersion}.#{getFileType(@dataFile.document_content_type)}")


      redirect_to :controller => 'upload',
                  :action => 'new',
                  :project_id => params[:project_id],
                  :document_id => params[:document_id],
                  :path_file => @dataFile.document.path,
                  :file_name => "#{ProjectDocument.find(params[:document_id]).getFileNameWithNewVersion}.#{getFileType(@dataFile.document_content_type)}",
                  :projectManagerAccessToken => @projectManager.access_token,
                  :projectManagerId => @projectManager.id
---
INSERT INTO "data_files" ("created_at", "document_content_type", "document_file_name", "document_file_size", "document_updated_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT  "project_documents".* FROM "project_documents"  WHERE "project_documents"."id" = $1 LIMIT 1  [["id", 40]]
SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = $1 LIMIT 1  [["id", 5]]