app/controllers/home_controller.rb

SELECT "tasks".* FROM "tasks"  WHERE (assigned_id = 1 and status = 'Open')
---
  def index
    @tasks = Task.where("assigned_id = ? and status = ?", session[:user_id], 'Open')