app/controllers/project_documents_controller.rb

SELECT "versions".* FROM "versions"  WHERE "versions"."project_document_id" = 31
SELECT "tasks".* FROM "tasks"  WHERE (assigned_id =1) AND (project_document_id =37) AND (status like '%Open%')
---
  def show

    @document_version = Version.where(project_document_id: params[:id])
    #@document_version = Version.all

    @project_documents = ProjectDocument.new
    @dataFile = DataFile.new

    @outputs=get_outputs(@project_document.pmbok_doc.name)
    @inputs=get_inputs(@project_document.pmbok_doc.name)
    @tasks=Task.where('project_document_id= ? and status= ?',params[:id],  'Open')

SELECT  "project_documents".* FROM "project_documents"  WHERE "project_documents"."id" = $1 LIMIT 1
---
    def set_project_document
      @project_document = ProjectDocument.find(params[:id])

SELECT  "project_documents".* FROM "project_documents"  WHERE "project_documents"."id" = $1 LIMIT 1
SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = $1 LIMIT 1
---
  def set_project
    @project_document = ProjectDocument.find(params[:id])
    @project = Project.find(@project_document.project_id)

SELECT  "project_teams".* FROM "project_teams"  WHERE "project_teams"."project_id" = $1 AND "project_teams"."project_role_id" = 1 LIMIT 1
SELECT "project_teams"."user_id" FROM "project_teams"  WHERE "project_teams"."project_id" = $1 AND (project_role_id =1)
SELECT "project_teams"."user_id" FROM "project_teams"  WHERE "project_teams"."project_id" = $1
---
  def get_projectmanager
    @project_document = ProjectDocument.find(params[:id])
    @project = Project.find(@project_document.project_id)
    @project_manager =@project.project_teams.find_by_project_role_id("1")
    @project_manager_user=@project.project_teams.where("project_role_id =?", 1).pluck(:user_id)
    @project_current_team=@project.project_teams.all.pluck(:user_id)