app/controllers/projects_controller.rb

  def new
    @project = Project.new
    @project_manager_role =ProjectRole.first
---
SELECT  "project_roles".* FROM "project_roles"   ORDER BY "project_roles"."id" ASC LIMIT 1 OFFSET 1

  def create
    @project = Project.new(project_params)

    @s = project_params[:start_date]
    @e = project_params[:end_date]

    respond_to do |format|
      if @project.save
        @pmbok_docs =PmbokDoc.all
        @pmbok_docs.each do |pmbok_doc|
          @doc_name=@project.projectcode+'_'+pmbok_doc.name
          @project.project_documents.create(:project_id => params[:id], :pmbok_doc_id => pmbok_doc.id, :docname => @doc_name, :status =>'pending to initiate')
---
INSERT INTO "projects" ("created_at", "description", "end_date", "name", "projectcode", "start_date", "status", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT "pmbok_docs".* FROM "pmbok_docs"
INSERT INTO "project_documents" ("created_at", "docname", "pmbok_doc_id", "project_id", "status", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def manage_document
    @project_documents = @project.project_documents
    @ARR=@project.project_documents.where('docname ILIKE ? ', "%Activity Resource Requirements%").first
    @HRMP=@project.project_documents.where('docname ILIKE ? ', "%Human Resources Management Plan%").first
    @PSA=@project.project_documents.where('docname ILIKE ? ', "%Project Staff Assignments%").first
    @PMP=@project.project_documents.where('docname ILIKE ? ', "%Project Management Plan%").first
    @RCAL=@project.project_documents.where('docname ILIKE ? ', "%Resource Calendars%").first
    @TPA=@project.project_documents.where('docname ILIKE ? ', "%Team Performance Assessments%").first
---
SELECT  "project_documents".* FROM "project_documents"  WHERE "project_documents"."project_id" = $1 AND (docname ILIKE '%Activity Resource Requirements%' )  ORDER BY "project_documents"."id" ASC LIMIT 1
SELECT  "project_documents".* FROM "project_documents"  WHERE "project_documents"."project_id" = $1 AND (docname ILIKE '%Human Resources Management Plan%' )  ORDER BY "project_documents"."id" ASC LIMIT 1
SELECT  "project_documents".* FROM "project_documents"  WHERE "project_documents"."project_id" = $1 AND (docname ILIKE '%Project Staff Assignments%' )  ORDER BY "project_documents"."id" ASC LIMIT 1
SELECT  "project_documents".* FROM "project_documents"  WHERE "project_documents"."project_id" = $1 AND (docname ILIKE '%Project Management Plan%' )  ORDER BY "project_documents"."id" ASC LIMIT 1
SELECT  "project_documents".* FROM "project_documents"  WHERE "project_documents"."project_id" = $1 AND (docname ILIKE '%Resource Calendars%' )  ORDER BY "project_documents"."id" ASC LIMIT 1
SELECT  "project_documents".* FROM "project_documents"  WHERE "project_documents"."project_id" = $1 AND (docname ILIKE '%Team Performance Assessments%' )  ORDER BY "project_documents"."id" ASC LIMIT 1

  def get_projectroles
    @project_manager_role =ProjectRole.first
---
SELECT  "project_roles".* FROM "project_roles"   ORDER BY "project_roles"."id" ASC LIMIT 1

  def get_projectmanager
    @project_manager =@project.project_teams.find_by_project_role_id("1")
    @project_manager_user=@project.project_teams.where("project_role_id =?", 1).pluck(:user_id)
---
SELECT  "project_teams".* FROM "project_teams"  WHERE "project_teams"."project_id" = $1 AND "project_teams"."project_role_id" = 1 LIMIT 1
SELECT "project_teams"."user_id" FROM "project_teams"  WHERE "project_teams"."project_id" = $1 AND (project_role_id =1)