app/controllers/session_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."uid" = '107422063451239561529'  ORDER BY "users"."id" ASC LIMIT 1
INSERT INTO "users" ("access_token", "created_at", "email", "encrypted_password", "expires", "firstname", "lastname", "refresh_token", "role_id", "uid", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create

    Rails.logger.debug('Start to update or crate user detail from google')
    # Get user tokens from GoogleHelper
    user_tokens = get_tokens(params[:code])

    Rails.logger.debug('User token:' + user_tokens.to_yaml)

    # Get the username from Google
    user_info = GoogleHelper.call_api('/oauth2/v2/userinfo', user_tokens['access_token'])

    user = User.where(:uid => user_info['id']).first

    # Create the user if they don't exist
    if(user == nil)

      Rails.logger.debug('Try to create user:')
      Rails.logger.debug( user_info)

      user = User.create(:email => user_info['email'],
                         :firstname => user_info['given_name'],
                         :lastname => user_info['family_name'],
                         :role_id => 2 , ######3 wait to keep role_id
                         :uid => user_info['id'],
                         :refresh_token => user_tokens['refresh_token'],
                         :access_token => user_tokens['access_token'],
                         :expires => user_tokens['expires_in'],

                         ### Put to fill for null :false from schema
                         :encrypted_password => 'ILoveYou',
                         :sign_in_count => 0


                        )

UPDATE "users" SET "access_token" = $1, "expires" = $2, "updated_at" = $3 WHERE "users"."id" = 3  [["access_token", "ya29.VwFbkttc8YhsYsR0mXOoM19w0_vo4SimUTvlo-BF-eqZMbUnN_iCAheI68fmh8EOuiRg9Lrw-jv9MQ"], ["expires", nil], ["updated_at", "2015-04-16 12:44:10.219516"]]
---
     # user.refresh_token = user_tokens['refresh_token']
      user.access_token = user_tokens['access_token']
      user.expires = user_tokens['expires']
      user.save