app/controllers/tasks_controller.rb

SELECT  "project_documents".* FROM "project_documents"  WHERE "project_documents"."id" = $1 LIMIT 1
SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = $1 LIMIT 1
UPDATE "project_documents" SET "status" = $1, "updated_at" = $2 WHERE "project_documents"."id" = 47
---
  def create
    @project_document = ProjectDocument.find(params[:task][:project_document_id])
    @project = Project.find(@project_document.project_id)
    create!(:notice => "Task is created.") { project_project_document_path(@project, @project_document) }
    @project_document.update(:status =>'Task pending')

SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = $1 LIMIT 1  [["id", 22]]
SELECT  "project_documents".* FROM "project_documents"  WHERE "project_documents"."id" = $1 LIMIT 1  [["id", 31]]
SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = $1 LIMIT 1  [["id", 4]]
SELECT "project_teams"."user_id" FROM "project_teams"  WHERE "project_teams"."project_id" = $1  [["project_id", 4]]
---
  def edit
    @task = Task.find(params[:id])
    @project_document=ProjectDocument.find(@task.project_document_id)
    @project = Project.find(@project_document.project_id)
    @project_current_team=@project.project_teams.all.pluck(:user_id)

SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = $1 LIMIT 1  [["id", 22]]
UPDATE "tasks" SET "status" = $1, "updated_at" = $2 WHERE "tasks"."id" = 22  [["status", "Completed"], ["updated_at", "2015-04-11 18:13:57.206621"]]
SELECT  "project_documents".* FROM "project_documents"  WHERE "project_documents"."id" = $1 LIMIT 1  [["id", 31]]
SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = $1 LIMIT 1  [["id", 4]]
UPDATE "project_documents" SET "status" = $1, "updated_at" = $2 WHERE "project_documents"."id" = 31  [["status", "File accepted"], ["updated_at", "2015-04-11 18:13:57.249340"]]
---
  def update
    @task = Task.find(params[:id])
    @task.update(task_params)

    @project_document=ProjectDocument.find(@task.project_document_id)
    @project = Project.find(@project_document.project_id)
    if params[:task][:status]=='Completed'
      @project_document.update(:status=>'File accepted')

SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = $1 LIMIT 1  [["id", 26]]
SELECT  "project_documents".* FROM "project_documents"  WHERE "project_documents"."id" = $1 LIMIT 1  [["id", 40]]
SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = $1 LIMIT 1  [["id", 5]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 26]]
---
  def destroy
    @task = Task.find(params[:id])
    @project_document=ProjectDocument.find(@task.project_document_id)
    @project = Project.find(@project_document.project_id)
    @task.destroy