app/views/version/_index.html.erb

            <td width="1%"></td>
            <td width="10%"><%= User.find(dv.user_id).fullName %></td>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]