app/views/project_documents/show.html.erb

SELECT "tasks".* FROM "tasks"  WHERE (project_document_id =47) AND (status like '%Open%')
---
          <% if
          (current_user.id == @project_manager_user[0] && Task.where('project_document_id =?',@project_document.id).blank?) ||
          (current_user.id == @project_manager_user[0] && Task.where('project_document_id =?',@project_document.id).where("status like ?","%Open%").blank?) ||
          (current_user.id != @project_manager_user[0] && !Task.where('assigned_id =?',current_user.id).where('project_document_id =?',@project_document.id).where("status like ?","%Open%").blank?)

SELECT  "subprocess_groups".* FROM "subprocess_groups"  WHERE "subprocess_groups"."id" = 11 LIMIT 1
---
      <div class="col-lg-4">
        <span> <%= SubprocessGroup.find_by_id(@project_document.pmbok_doc.subprocess_group_id).code %>

SELECT COUNT(*) FROM "templates"  WHERE "templates"."pmbok_doc_id" = $1
---
    <div class="row">
      <% if @project_document.pmbok_doc.templates.size > 0 %>